app/controllers/articles_controller.rb

  def index
    @articles = Article.search(params[:search])
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello World"], ["body", "Wow, Rails is super easy and fun!"], ["created_at", "2016-05-31 16:16:12.999276"], ["updated_at", "2016-05-31 16:16:12.999276"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3